;;; try-etbl.el --- Try-Code extention table

(setq tcode-tbl [
;¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¥î¥ð¥ñ¥õ¥öÀÁ¶­·ÏÃµ¾Ý¤î¤ð¤ñ²­ÆìÀ¹³×ÆÍ²¹ÊáÇÙÃèÀô½ðÊ³°ÍÁ¡¼Ú¿ÜÌõ
"¢£¢£¢£¢£¢£¢£¢£¢£¢£¢£¢£¢£¢£¢£²Õ»¬ºæÉèÄå¢£¢£¢£¢£²§µê¢£·¤±ìÈ©Âá¢£¢£¢£¢£¢£¢£¢£ÀË¢£¢£"

;¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢±¯±±±ã±ï±È¾°²ì´ßÀÕµù±÷±ø²µ²º¼Î±×±ç¼þ°è¹ÓÇÒÃÈÀ¿½ÌÊ¢¿¥ÉãËçÍð¹á
"¢£¢£¢£¢£¢£¢£¢£¢£¢£¢£¼öµÏ¢£¢£±Ì¢£¶àÉÍ¹×ÎÄ¢£Å¥¢£¢£´þ°î¢£³À·÷¹²µ§´Ë¢£°à¸ÝË¥Ìì¢£ºø·°"

;¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢µ´µõ¶¹¶¼¶Ã¼Ë´î´´µÖÅü´ñ´ûµÆµÑµý¹¯ÅÌ·Ê½è¤¼ÆÏÃÂÀ»½ÄÈÕ¾ù¥ØÌÏ¹ßÁö
"¢£¢£¢£¢£¢£¢£¢£¢£¢£¢£½¹±³¶´¢£Ø³Åï±Ù¢£ÎÍÌªåº¢£¹í¢£Ë£¢£¢£¢£µò¼Ù¢£Ïª¢£¼Ð¼à¾ú¢£Çü¢£¶î"

;¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¸É¸Ø²«¹¡¹ÌÉÛ¶ì°µ·Ã¸Ç¹ª¹îº©º¤ºªË®Éñ»¨´Á¶ÛÄ¬Â¡¿Î¼ÜÈÉ·ã´³É§¶ÑËô
"¢£¢£¢£¢£¢£¢£¢£¢£¢£¢£¸ÌÃÑ¢£ÈÞ¢£ÈÁ¢£À¬¢£´èµà¢£º¦µç¢£¢£Æ§ÈÚÃ²¢£±²´Î¢£¼ÛÈÃÆÅ´¥¸Á¹Õ³î"

;¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢ÊôË¿ËÆËÎ¹Ý»ÑÀäÌ©Èë²¡»ì»ê»½¹ò¼§½°Àá¿ùÆù½üÇÐÄºÀ÷¾ëÊÅÂ¬·ì»¶¾ÐÊÛ
"¢£¢£¢£¢£¢£¢£¢£¢£¢£¢£ÊðÇÞ¢£ËÑ¢£¢£µñÁÆÓñÍÞËí¢£·¬³Ì¢£¢£¶û¢£¢£ºïÇÓÆ½¿»ºÖÅÂÇé´À»µÏÎ¾£"

;¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¸ÐÎéÃø°Ü¶¿Â©»í½¦½ë¾¼½þ²¤ÅØÄì°¡ÈáÃìÅ«Æ¸Èª¶Ø¾Ë¼ù¶çÁÃ¹ÄÁüÈî±èµÛ
"¢£¢£¢£¢£¢£¢£¢£¢£¢£¢£¸ÒÎîí°¿Õ¶ª¢£ÊÓ¢£¢£¢£Çå¢£ÅÜ¢£°¢¼äÀÔ¿á²ýÀ¦¢£¢£Äß½ÜÁ¿Ä¿¾Ó¢£¢£ÅÇ"

;¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢Ã¼¾þÍ¹±ö·²ÌÄÀ±ÀÏÁ«Àë¹È½ý¹ë°ÝÃ¦ÁÍÁâÁÕÂºÅá¸¨Èï¸»´êÎ×¶»¼ÕÂ»É¶³¥
"¢£¢£¢£¢£¢£¢£¢£¢£¢£¢£Àí¢£ÄþÙæ¢£¢£¶ý¢£¢£µ¹¢£áç·æÍåÇíãâÁæÃÆ±½¿ÏËúÈä¢£¸Ü¢£»Ý¢£¢£¾ö¢£"

;¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢ºþ¼÷½ç´íº½½î¾Ñ¾æ¾Î¾øÊÞ½¼µÊÏÓË½Åß³­¸¤¿¹ÎÓÈã·Ä¾ÄÎµÊ»·ÉÀåÅ¨ÉÏ³Õ
"¢£¢£¢£¢£¢£¢£¢£¢£¢£¢£Þúí´ÃàÀÈÇù¢£¢£¾ó¢£ÍÒ¢£¢£¢£»è¢£Æé³ªÉú¢£ÎÔ½Ú¢£Ä½ÃÀÌß¢£çÓ¢£¢£¢£"

;¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¿Ì°·ÊÒ»¥¸ð°ÅÇµÇ¡ÆôÄ¢ÎØÅÝÁàÊÁµûÇÏ²Î³¨µÝÀ²½¢Ãó´øÃ°Á¯·êÁ¬Æ¼Êè´ù
"¢£¢£¢£¢£¢£¢£¢£¢£¢£¢£ÂÑµâÊÐËÚËø°Ç¢£¢£ÁÎÊíº¿Åþ·«Êº·ßµ³ÍÙ¼¬Ä¤¢£½³ÆÖ¢£¢£´Ú¹¦Á¨¿îÊ¯Âî"

;¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¢¹°ÄËÉ¼ÁÊ°äÍóÎ¶Î¬Î¸ÎßÂ§Â¸ÇÜµí¼áÇþÄï·»»ÐËå¹Ë³ãÁÏÇØÈé¹§ÁÄÇ³ÍÂµ®
"¢£¢£¢£¢£¢£¢£¢£¢£¢£¢£¢£ÄÃ¢£¢£¸¯Íö½±¿¯ÎºÎÝ¢£¢£¢£ÆÚ¢£¢£½ÇÇì¾îÌ¼¢£¢£¢£¹øÉæ¢£ÁÀË¨¢£²í"

;¥ò°¥²Ë·¼ÇÄ»ÀÃëÃº°ðÅò²Ì¹ðºö¼óÇÀÊâ²óÌ³Åç³«Êó»æ´ÛÌë°Ìµë°÷¤ÉÂå¥ì·ç²ÆÈàºÊÁ±Áê²ÈÅªÂÐÎò
"¢£Åé´×Å¯ÄÏ¿Ý¢£¢£ÊæÊ¨²Û¹óÅ®¶ßÇ»Çç½ä¢£ÅèÂó½·Ëì´Ü¢£¼ß±Â¢£Îì¢£Ý¦´Ù²ã¢£À¨Á·ºË¸®¢£¢£Îñ"

;¥¥°©²ç·ÇÈ²ËÇÁÜ°ÛÎÙµì³µÇã¾ÜÍ³»à¥­¤»¶èÉ´ÌÚ²»²¦Êü¡¹±þÊ¬¤è¥ëÀé¥¢ºâ¿ËÎ¢µïº¹ÉÕ¥×¤Ð¥åºî
"¢£ÁøÅã±Ú¢£¢£¢£ÊµÎù¢£³´¹ØÁÂÂµË×¢£¾ß¶§Æ­Æ¶±¤´§Êï¡µÈ¦ÈçáÚÑÜäµÁñ¢£Äàº¨¿øæ·ÉíÌ½Çâ¢£ÂÌ"

;¥ô°¸²õ·ÈÈò¹¶¾ÆÆ®ÆàÍ¼Éð»ÄÎ¾ºß¡ª¤ä½Ð¥¿¼êÊÝ°Æ¶Ê¾ð°ú¿¦£·¤«¡Ê¥È¤ì½¾¹ü¸ü´éÎÌÆâ¹©È¬¥Æ¸«
"¢£ÏÐ²û³óíä¢£¼Ñ¢£Æè¾¬ÉêµÔÁÐ¢£³å¢£Ãê»¢¾¸Ëó¢£¶þÂÆÌ¥½Þ¢£²Éðþ´áÚÌ¶³¿ñÇö¹àÎÈ¢£¾¢Âý¢£Ä¯"

;¥Â°Ï³Ó·àÈÜÈ×ÂÓ°×Â®³ÈÉ÷³¬Ç½ÏÀÁý¥³»³¼ÔÈ¯Î©²£¶½»ÉÂ¦³Ð¤­¤ÃÆü¹ñÆóÅ¬Îà¸æ±§¿ä¶åÌ¾Àîµ¡¥Á
"¢£Ê½¢£î±ÈêÀûÂÚÌÞÉÒ¢£Íò¢£ÈíÎÑÁ¹¢£ÆÌÈ¤¹ÚºÁÏÆËÖ·õãþÀÃµ¦¢£¾½ºÄÆõÃä¢£¢£±ªÁ¦¿¬À«·Ì´öÃâ"

;¥Å°Ã´¨¸­ÈÍµ¥´¹±äÀã¸ßºÙ¸ÅÍø¥Ú¤ã¥Ê¶â¥ÞÏÂ½÷ºêÇò¤°´±µå¾å¤¯£¸¤¨Ç¯Êì±ü°ø¼ò¿­¥µ·ú¥ÑÂèÆþ
"¢£ÄâºÉ¶ò¢£¢£´­¢£Áú¢£¶®¸ÏÎ¡ÊÇ¢£¢£²Ô¢£¢£½ÊÌ¨Ã¸¶ó¢£Î³³³¢£Ëª¢£ÁÔÇÌ¢£°ù¿ì¢£¢£¸°¶Ô¢£ÁÞ"

;´ÊÄ§¿¨½¡¿¢É¡º÷¼ÍÂùËý³²ÄÂÀ°·ÚÉ¾º´Ë¡¿ôÏºÃÌÉþÀ¼Ç¤¸¡Ë­ÈþÂê°æÍÎ¼ÂÇúÃçÃãÎ¨ÈæÀÎÃ»´äµðÇÔ
"¢£Èù¿ª¿òÈ­½­¢£íÕÀ¡Ì¡ÁË¢£¢£ÊÎ¢£°ÓÇ¦ÌùÏ­¾éÍç±ðÉë·ð½áÎïÀ§Ð§ÅâÁ©¢£Î·³ì¢£º³Á½½Æ¾ÌË¤Éå"

;¾µ¾Ï¸õÅÓÊ£É¹ºý¼ûÂÂÌÂ·âÀÞÄÉÂâ³ÑÀÜÈ÷ºÇµÞ¸³ÊÑ¿³²þ¾º·Ý½ÉÀ©½¸°Â²èÍÛ¹½Î¹»ÜÍË±ó¥©¾­¤¾ÄÍ
"¢£·®¸ô½ù¢£Åàºô¼ôÏÍÆæ¢£ÀÀÄÊ¢£¶ù·ÒÍ«»£Ë»¢£Ì¯ÇæÄû¢£¢£Çñ´â¾ÇÎ÷¢£ØË¹Â¢£¢£Âõ¢£¢£´ý¢£¢£"

;²÷ÈÝ»õÉ®Î¤Ìý»®½´ÃßÌáÍá½¨»å½Õ¹¬µ­Ä«ÃÎ¥ïÁ÷¸Â¸¦Ï«ÅýÌò¥»±¿¥ÄÆÃÃ«¥¡Æ³Ç§·òÈø½ø¿¶ÎýÇ°Æ¯
"Ìû¹Î³ú¸§ÎÒ»é³¸³í¢£¢£ÁåÍ¶¸¹Å½¿ÉÄÖ¶ÇÃÒ¢£Â£¿Ô¢£Èè¢£¸Ô¢£ÈÂ¢£¼ì±ú¢£¢£¢£ç§³áÃá¿±Ï£Ç±¸Û"

;ÊñÇ¼ÍêÆ¨¿²ÎÐ»¿½ÖÃùÍÓÀÑÄøÃÇÄã¸º¥â»ñ»ÎÈñ¥£µÕ´ëÀº¤¶°õ¿À¤ÓÂÇ¶Ð¥ã»¦Éé²¿ÍúÈÌ¼ª¼øÈÇ¸ú»ë
"Êú¾ä¢£¼üÌ²»ç»¾¢£¢£ÌÅÄÒ¢£¼×ÄñÌÇÝ¨¢£»ø¢£¢£ÁÌ¢£ÍÅ»Ã¼¥ÀçÈü²¥¶Ï¢£¹ÊÄç»Ç¢£Â¯ÊÉ¢£¢£³¯ÌÕ"

;¾§Êë·ûÊÙºá²ê°û½âÃî±Ë¸Î¹ÛÄó»ùÉßÌµÀÐ²°²òÊçÎá°ãÁõÁ³³ÎÍ¥¸øÉÊ¸ì±é·ô°­½©ÈóÊØ¼¨Â¨ÆñÉáÊÕ
"¢£¢£¢£¢£È³Å¦³éÌ·º«Àø¢£Ï§ÄéÂÛ¢£Éµ¸´°®Ë¶Êé¾Û°Î¢£¢£¢£Îô³ÔÇÑ×ÃÃÅ·ýËâ½¥ÈåÇ¢Äè¢£ÆçÄÁ°ë"

;¤Ñ°Ö²æ·óÉ©ºùÀ¥Ä»ºÅ¾ã¼ýºÝÂÀ±àÁ¥Ãæ¥¹¤â¤ªÄê¼ï²¬·ë¿Ê¿¿£³¤È¢ª¤Æ¤ë¥Ò¹¾ÊÌ¹Í¸¢¥Ã¿Í»°µþ¤Á
"¢£¢£ÇÚ¸¬¢£Ï°¢£·Ü¢£³·³Ï¢£ÂÁ±ñ½®ÍÇ¼ÊÌÔÀð¾ûÅ÷¢£º§´«¿µ»¹ÅÒÎíÄæ¢£¼¸¢£»«ÚÊÇÆ¢£±îºµÎÃÃÚ"

;¤Ô°Ù³Ý·ùÉ³ÅµÇî¶ÚÃéÆý¼ãÍººº¤Õ¾Þ¤ï¥éÅìÀ¸¤íÂð½ÏÂÔ¼è²Ê¡¼¤·¤¿°ì¤¬µÚµ×Â¢ÁáÂ¤¥í¥¯ËüÊý¥Õ
"¢£µ¶·µÈÑÇû¢£¢£¢£¢£ºñÆ¿»ó¢£Ã¿·üÇÊé¯ÄÄ³¶ÏµÅ¡½Î´¾Ã¥ÅÍ¢£×óÃ¡°í²î¢£µä¢£¢£ÙÔÏ¤¶æ¢£Ë§ÎÕ"

;¤×±¢´º¸²ÉÁºÎÍØ´õÊ©»¡»Ø»á´ÝÂ³¥§¤¦£´¡Ë½½¥êÎÁÅÚ³è¤Í»²¤¤¡¢¤Î£µ£±ÅêµÁ»»È¾¸©¤ó¤Þ¥ó¤Ä»Í
"¢£ËÅâ×¢£Ç­¢£ÍÉµ©¸ç»¤ÀÍ¢£Åû·ÑÅÊÝµ±¼í¦½À¢£¢£¾í³ç¢£»´Ãò¡¤¢£¸êËÊºüµ··åÈ¼¢£¢£Ëá¢£»ÌÉ¤"

;¤Ú±£´Å¸£Ê°·¯½ãÉûÌÁÉ¸¤®³Ê¼¡½¬²Ð¤¢¤³£¶³Ø·î¼õÍ½ÀÚ°éÃÓ¡£¢¡£°¡¦£²¹þÂô·³ÀÄÀ¶¤±¥¤¤¹ÅÅÃÏ
"ÄÙÊÃ°»¢£Ê®É¿Æß¢£¢£Éºµ½¢£Á¢À¢±ê°¿»Æ¢£¾©ÊøÂÅÍ±»ÂÇÝÌø¡¥¢£ÅÉ¢£ÄÛ¢£¢£¢£º°½Í·Ó¿Ö¿õÍë¹ö"

;¤Ý°ß´µ¸·ÊÀÈÈÍ¾ËÙ¸ªÎÅ»×½Ñ¹­ÌçÊ¹ËÜ¤µ¤é¹â¥·±Ñ¥Ü²Ã¼¼¾¯¤Ç¤Ï¤Ë¤Ê¤òÅ¾¶õÀ­»Èµé¶È»þ¡ÖÄ¹¤ß
"¢£°â¶ú°ÒÊ¾¢£¾ê·¡ËÐ¢£¼Å¢£´²Á®Ä°ËÛº¶¢£¹Æ¢£½ÓËÕ¢£¢£º»¢£Ã¾Æ÷Éï¢£ÂÉ¹µÀ·¾¤¢£¢£Ë¢¡ØÍª¢£"

;¼ëÃÙ¹ÃÃ×ÈÆ´ú¿ê¼¢ÄÀ¸ÊÉÂ½ªµ¯Ï©±Û¤àÆî¸¶±ØÊªÀªÉ¬¹Ö°¦´ÉÍ×Àß¿åÆ£Í­ÁÇÊ¼Àì¿ÆÎÀ¥Û¶¦¥ÖÊ¿³Ú
"¿ý¿×¢£¢£ËÞ´È¢£»üÉâÛ¹±Ö¿ëÎåÊ×Ä¶Ì¸¢£¼¿¢£Í£¢£¢£¢£Û£¿û¢£¢£·Ö¢£ÏÅ¸¼¢£¢£ÀÌÎ½¢£¹¿ÒìÂÙ¸ä"

;¿ØÄá¼¯²ßÍíµã¿ö¼¾ÅºÖá¾ïÄ¥ÌôËÉÆÀ¥±¼°Àï´ØÃËÍ¢·Á½õ¡þÎ®Ï¢Å´¶µÎÏ¥ÙÌÓ±Ê¿½ÂÞÎÉ»ä¥´Íè¿®¸á
"¢£µµÏ¼¢£¢£¶«â²Áç¢£¢£¹±Ä±ºÞË¸³Í¢£¿¡´ÏÈ¡¿ÂÍ¡¢£Ï¾¢£Î²ºÜ±ôÄ¼í÷¢£È±¹å¢£´®²ÂËÍ¸é¶¸Â÷´Ì"

;´ãÈË»ï¾·µ¨µß¿â¿ÓÅ°Ì¦»û¼Á¤Å¹Á¾òÏÃºÂÀþ¥À¶¶´ð¹¥Ì£ÊõÁè¥Ç¸½¥¨Â¾ÅÙÅùÀõº¢ÍîÌ¿Â¼¥¬À½¹»¤´
"ÀÉ¢£¢£æÛ¢£¢£¿ç´ªÅ±¢£Áµíµ¢£ÏÑ¼ÄÃýºÃÁ£¢£²ÍÂ¶ÓÏËæ¢£¾ÙÏÄ¢£¢£ÃÐ¹Å¢£»··¹ÄÆº²Éó¢£¢£¢£¸ë"

;¼¹¾ÒÌ´²·°¤¶À¿è²ÙÄÞÇÃÄäÎÎÍÆ¶Ì±¦¤ÙÌ±¥½ÅÀ¶øÂ­ÁðÃÛ´Ñ¸À¼ÖÀ®Å·À¤Ê¸ÈÄµÒ»ÕÀÇÈô¥Î´°½ÅÌó³Æ
"¢£¢£Ñ³¢£Êò¢£¼ñº­¶×¢£¢£ÈÒÍÏ¼îÌÃ¢£æ«¢£Å©¶öµÓÁôÃÞËµÛ©³êÂ¥¾²ÝõÀÛËßÉÐ¿ã±ÔÄ·¢£àú¾×·ÀÍï"

;³Ù·º¼å±ÀÁë·±À£Æ·Æ«º×²ÏÃÖ¶¡»îÀÊ´ü¥¾ºÐ¶¯·¸ÉØÃÊ±Ò³Û½Â¼ç±Ç½ñ²Ä¤ØÅÁÄí²ÝÃåºä¶á³°ÊÆ¥ç¸÷
"Êö¢£ÆðÆÞÈâí¿ÉªÇ¨Åñ¢£ÂìÁ¼¢£Ä©¢£»Û¢£Îð¹ä¢£²ÇÃÃÏÇËË¢£Ë·¢£ºØ²×¢£±¾¢£¢£ÆÜ¢£Á²¹ÙÄÚ¢£µ±"

;¤¡·§´¤ËëÍü¸ÆÉý´¿¸ùÅðÆÁÅÏ¼éÅÐÂàÅ¹»ýÄ®½ê¤Û·ïÍ§Â´½é´·¹Ô¥É±ß¾®¥¸¥è¸í¾Ú´Þ¡ó³¤Æ»¤ºÀ¾¤²
"¢£¢£ÉÓ³ë¢£±ù¶Ò¢£¢£Àà¢£ÏË½å¢£ÂÜ¢£·ø¢£Á§Ë«¢£ÌÖ¢£ÍµÆëÀÂ´½Æú¢£¼»¢£¸â¢£ð÷¢£Â±µ°¢£·ª¢£"

;¤£É²Í÷ËÀºëµªÇË·´¹³È¨³£´©Ë¬Í»±«Á´¤¸¼«µÄÌÀµÜ°Ëµáµ»¼ÌÄÌ¥«¼ÒÌîÆ±È½µ¬´¶ÃÍ¥®ÅöÍý¥á¥¦¥°
"¢£É±±Ü¼´¢£¢£ºÕ¢£¹£ÇÅ²ü¢£¿Ò³Ö»±³§ð×Æòµ¾Æ©ÄîÉ¨¢£µ¸Æ¥´Ó²²¢£½ÃË°¢£¢£´¸¢£Äü³ºËäÁÖ±¨¢£"

;¤¥ºåÍñË´ÆÊË¼ÀÓ¼±Â°°áÄë»ÏÎ»¶ËÇ®¥ÐÉôÏ»·ÐÆ°¶ÉÆ¬ÇÛ¹õ±¡¤À¤ê¡Ä¤áÂçºÑµÈ¤æ´ï¾ÈÉÔ¹çÌÌÀ¯¥ª
"¢£¢£±¬Áò¢£¿ßËÂßõ¾ü¾ØÄùóÕ¢£¢£¼Þé¬¢£¢£°ÞÌö¢£Ë¹¸ûËÏ¢£ÂÃ¢£ÌÛ¢£ËÄÀÆ¾ÍÌàÇÕ¢£Ç¥³æÌÍÀÝ¢£"

;¤§´ôÍâÊÄ°ñµîµ¿¤ÂÌÊÎ¥ÆÉÎë¶²ÆÄ¶·¸å´Ö¾ì¥Ë»º¸þÉÜÉÙÄ¾ÁÒ¿·¡×£¹»Ò¸ÞÀâ½µ¹æÍÕÇÉ°Ñ²½¥ÓÌÜ»Ô
"¢£¢£¢£Éõ¢£¶±¶Å¼¦¶Óµ÷±Ó¾âÉÝÊÍ¢£²ù·äÍÈ¢£ÃÜÌ»ÐíÉÚ¿£Áä¿Å¡ÙËØË¦¸ã¢£¢£ÉäÄµÈ¶»ðÍ©¢£ÎÞ³Á"

;¤©ÉìÎ§ÍÄ²¶ÉÃÈÏ³Ë±ÆËãÂ²ÃúÌ¤ºÍÊÖÌä¥à¼·½»ËÌ³ä¤ÖÈÖË¾¸µ»öÅÄ²ñÁ°¤½µÙ¾Ê±ûÊ¡Ëèµ¤Çä²¼ÅÔ³ô
"¢£¢£¢£ÃÕÏ³¢£áÆ³¼¸¸Ëà¢£Ç«¢£¢£¢£¹é°§ÊÊ¢£ÐªÎö¿«ËÝ¢£Ã¶¢£ÈÊÉ°Â·Áº·ÆÄ¨¿Ä»ãÉîÊ·´òÂÄ¢£¶Ý"

;ÍßÁãÌÐ½ÒÏ¯»÷¿ÃÅôËÒ±ýµ¢Ä£ºòÀ×¥²Àö±©¸Ä°åÀÅ²¯Ï¿ÀÖÁÛ¾Ã»Ù¶¨ÍÑÉ½Àµ¿Þµó¸±¥¼ÇÈ¥ä¿´³¦°Õº£
"ÍÝ·¢é®½ö¢£¢£²éÅõ¢£¢£ÁÝ¢£º¾º¯Â×¾ôÍã¢£¢£Áû²±¾¶³ÅÌÑÌ×´ì¢£¢£¾´¶º´Õ¢£ËÁ¢£Ï²¢£ÃïÁÅ¿ï¶ã"

;Ç÷ºÒÎøÇ¾Ï·²¾·ÂÂ«ÆÇÌ®´Æ´óºÛÃ£¼Ç¶ÁËºÆ¤»Ë´Ä¿§ÂßÈÎÊÔ»ÅÀèÂ¿¾¦¥Ï¸òÇ·Ëö¤Ü³¹ÌÈºÆ¥Í¡Á¸ýÂæ
"¢£ÌñÁþÇºÊÜ¼í²ø¹´¢£ÇïÍô°ØºÏ¢£´¢¶Â´÷¢£Íù½ÛºÌ¢£ÆøñÙ¢£Á­ÉÑ¢£ÂþÇÖË³ËõËÃ¢£¢£¢£¢£¼Ø¿°ÂÕ"

;Î±Îó¹ïÆ¦´Ç·éºÚÂ¹ÇßÍ¦ÃÝÃí²ð¶ñ¼º»Ê·Þ²ÚµöÊäº¸ÂÖ²Ö±É¥¶Ä´º®¥Ý·è¥ß½£Ê§¾è¸Ë¾õÃÄ·×É×¿©Áí
"Î¯ÎõÄ¦°ò¿Ç¢£¢£Â½Åí¢£ºûÃð³©×üÁÓÇÁ¶Ä¢£Âú¢£¢£µ¼ºéÍÀ¢£¢£¢£¢£¢£¢£¢£¢£Åë¢£¾É²ô¢£¢£µ²Áï"

;ÂØ¾Â¡©¼­¸¥»Þ½ËÃûÈÓ±Õ¤å½¤µæÅúÍÜÉüÊÂ±º¥æÎä¤ÌÅ¸·Ù·¿Ã¯ÁÈÁªÅÞÂòÂÎÎãËþÄÅ½àÍ·¸Í¤Ò¤ç²ÁÍ¿
"¢£¢£ÃÔ¢£¢£¢£¢£Ä¸¿æ½Á¢£Á¶¢£¢£ÉÞÊ¤¢£³÷¢£¢£ÅÛ¢£¢£ÏÈ¢£¢£¢£¢£¢£Æ¹¢£µÍ¢£¢£µºÀÒÈõ¢£¢£Ìã"

;´Ô¹¹ÀêÈ¢Ìð»ô¾¾Ä²Ê´²¸»ÖÈ´¹ÒÁØ¿¼Ã´Î¦´¬¶¥¸îº¬ÍÍÆÈ»ßÆ²¶ä°Ê¥Ì±Ä¼£»úºà²á½ôÃ±¿È¥Ô¾¡È¿¥º
"¢£Å³Ç´Ãª¼À¢£¢£»òÊ¶¼ÏÆÆÀòÇõÁ¾¢£Ã¢Î´·þ¢£ÍÊ·ÔÌæ°ïÅ£¢£Çó¢£¢£¢£ÌþÉÄ¢£²Ò½ïÌèÄú¢£³õ¢£¢£"
])

(setq tcode-non-2-stroke-char-list
      (mapcar (function
	       (lambda (str)
		 (tcode-string-to-char str)))
	      '("¢£" "¢¡" "¡þ")))

(setq tcode-special-commands-alist
      '(
	((40) . try-code-space)
	((0 0) . (lambda () (tcode-show-tables nil nil)))
	((0 9) . (lambda () (tcode-show-tables nil t)))
	((9 0) . (lambda () (tcode-show-tables t nil)))
	((9 9) . (lambda () (tcode-show-tables t t)))
	))

(defun try-code-space ()
  (interactive)
  (call-interactively (or (lookup-key tcode-mode-map " ")
			  'self-insert-command)))

;;; try-etbl.el ends here
