;;; ttc-rtbl.el --- TT-Code right table data

(setq tcode-tbl [
"* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * ¡Î¡ô* "
"* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * ¡Ð¡õ* "
"* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * ¡Ñ¡ö* "
"* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * ¡Ï¡÷* "
"* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * "
"* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * "
"* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * "
"* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * "
"* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * "
"* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * "
"* * * * * ¡±¡î¡ã¢å¢¾´§³Å²ã±î°Þ±èµÝ¹ò½¦Àå·Æ¶ã¶§µ·´ÕÃûÇ³ÈîËëÎí»±º¿¹Ú¹¦¸¯Ï³¡¨¡Ì¢ö¢«"
"* * * * * ¡°¡í¡å¡ê¢¼´¥³À²Û±ì°Ó±ÕµÛ¹Ý¼ÜÀ¿·À¶àµ÷µ¶´ÓÃìÆÏÈáËåÎì»¤º¾¹Ù¹£¸®Ï²¡§¡Ú¢õ¢­"
"* * * * * ¡®¡ì¡æ¡é¢½´¢³º²Õ±ê°Ò±Ëµ®¹Ä¼ÕÀ»·¹¶ßµòµ³´ÏÃèÆÇÈÕËÒÎÓ»£º¶¹Ø¸ô¸¬Ï°¡Å¡Û¢ô¢¬"
"* * * * * ¡¬¡ë¡ä¡è¢¿³î³¶²Ô±Ü°Î°û´ú¹§¼ÎÀ²·°¶Ýµñµ²´ÎÃÈÆ¼ÈÓËÀÎÐºøº²¹×¸ë·üÏ­¡Ã¡Í¢÷¢ª"
"* * * * * * ¢ò¡â¡ç¢Í³í³´²Ò±Ú°®°Å´ù¸¤¼§¿Î·®¶×µêµ±´ÌÃÂÆ¸ÈÉË´Î§ºñº°¹Õ¸ç·øÏª¡Â* ¢ø¢ù"
"* ¨®¨£* * * * * * * ¾Ç½ä½¹¼Û»ðÅ¥ÅéÆÆÇºÇõÁ¼ÀÛ¿õ¿Ò¾úÈÚÉÑÉúÊéËµÄÒÄ¤ÃÀÂÙÁôË×Ì¯ÌèÍÇÎ¡"
"* * * * * * * * * * ¾É½å½À¼ß»òÅ¦ÅëÆÌÇ»ÇöÁÂÀÝ¿ø¿Ô¾ûÈÞÉÒÊ¤ÊíË¶ÄÚÄ¦ÃÃÂÚÁøËÛÌ²ÌñÍÈÎ²"
"¨¸¨³¨¨¨½* * * * * * ¾Ì½ï½Á¼à»óÅ©ÅíÆÖÇÆÇùÁÅÀàÀ¡¿×¾üÈâÉÓÊ¨ÊïË·ÄàÄ¨ÃÅÂÛÁúËÝÌ·ÌöÍÉÎ³"
"* * * * * * * * * * ¾Í½ö½Ã¼ä»øÅ¯ÅïÆÚÇÌÇûÁÆÀçÀ¦¿Ý¿£ÈäÉÝÊ®ÊðË¸ÄâÄ©ÃÆÂáÁûËÞÌ¸ÌøÍÊÎ´"
"* ¨¯¨¤* * * * * * * ¾Ó½ù½Æ¼ì»üÅ±Å÷ÆÞÇÑÈ©ÁËÀðÀ§¿á¿«ÈçÉÞÊ¯ÊöË¹ÄåÄ¯ÃÑÂìÁþËßÌ»ÌûÍÏÎº"
"* * * * * ¡²¡ò¡Ý¢Þ¢º´²³Ö²ù²­±¤²Ù·±»Þ½ðÁü·Ü¶ù¶¸µ¾´öÄïÇÒÊ¢Í¦Îô»ÌºÕ¹ö¹¿¸Ï* ¡º¡Ô¡ù¡ú"
"* * * * * ¡¯¡ñ¡à¢Ý¢»´®³Ô²ø²§°ù²Î¶À»Ð½ëÁÄ·Ö¶ö¶´µ½´ôÄºÇÐÉÏÌýÎñ»ÇºÏ¹ó¹µ¸ÌÏÑ¡¸¡Ò¢¤¢¥"
"* * * * * ¡­¡ð¡ß¢Ü¢Á´­³Ï²ô²¥°ò²¾¶»»½½ÌÁ¬·Ô¶ó¶³µ¼´èÄ²¡¤É¹ÌÄÎð»ÃºÌ¹é¹´¸¼ÏÈ¡·¡Ó¢¢¢£"
"* * * * * ¡«¡ï¡Ü¢è¢À´«³Í²î±ú°ï²¸µãºÚ½ËÀ÷·Ñ¶ò¶®µº´Ù¡¥* É¶¡ÄÎï»·ºË¹ä¹²¸¹ÏÇ¡¿¡Õ¡û¡ü"
"* * * * * * ¢ó¡á¢æ¢Î´ª³Ì²í±ô°í±ýµßº×½ÄÀô·Ì¶î¶«µ¹´×Ä¬ÇÏÉ¡Ì®Îî»´ºÄ¹à¹±¸¸ÏÅ¡À¡Ø¢þ¡ø"
"¨·¨²¨§¨¼* * * * * * ¾×¾¢½Ç¼í¼¥Å³ÅûÆßÇÓÈ­ÁÎÀòÀ«¿ã¿¯ÈèÉâÊ¶ÊøË»ÄçÄ°ÃÔÂîÂ£ËàÌ¼ÌþÍÒÎ½"
"* ¨­¨¢* * * * * * * ¾Ù¾£½Ê¼î¼´ÅÂÅþÆìÇÕÈ±ÁÐÀøÀ¬* ¿°ÈêÉäÊ·ÊúËÁÄèÄ±ÃÕÂóÂ¥ËáÌÃÍ¡ÍÙÎÃ"
"* ¨¬¨¡* * * * * * * ¾Û¾¤½Í¼ñ¼¿ÅÇÆ¥ÆðÇÚÈ³ÁÓÀûÀ·¿æ¿±ÈíÉåÊºË¢ËÂÄéÄ¶ÃÜÂõÂ¯ËâÌÇÍ£ÍÞÎÄ"
"¨»¨¶¨«¨À* * * * * * ¾â¾©½Î¼ô¼ÀÅÉÆ§ÆõÇÝÈ¶ÁÔÁ¦ÀÀ¿ç¿µÈùÉæÊ½Ë¤ËÃÄîÄ·ÃàÂ÷Â±ËäÌÑÍ©ÍãÎÈ"
"¨¹¨´¨©¨¾* * * * * * ¾é¾¬½Ó¼ü¼ÏÅÍÆ©Ç¢ÇÞÈ¼ÁÝÁ©ÀÂ¿ë¿»É¤ÉèÊ¾Ë¥ËÄÄñÄ¼ÃáÂúÂÄËìÌÔÍªÍåÎÍ"
"* * * * * * * ¢ã¢ê¢Ð´Ë³ì³¯²Í±Ù³Õ·ê»÷¿ÃÂ»·÷·¬¶Ôµçµ°ÅôÈªÊèÍ÷Ï§»éºïº«¹Î¸ä* ¡´¡È¡¡¢®"
"* * * * * * * ¢â¢é¢Ï´À³ê³§²É±Ö³­·é»ô¿¹Â¹·õ·«¶Çµàµ§ÅáÇþÊÅÍñÏ£»èºéº¨¹Ê¸â* ¡³¡Æ¢¦¢§"
"* * * * * * * ¢á¢à¢Ê´¾³é²ý²Ç±Ô³¨·É»í¾ëÂ«·ð·¤¶ÅµÔ´þÅßÇßÊÄÍâÎ÷»çºÞº§¹Æ¸Ý* ¡¶¡Ç¡þ¢¡"
"* * * * * * * ¢ä¢ß¢Ë´½³ç²ü²Â±Ó³¥·Â»ì¾¾Â©·æ·¡¶ÄµÓ´ýÅ«¡ÙÊ´ÍÄÎö»ãºÜº¦¹Å¸Ü* ¡µ¡É¡ý¢¨"
"* * * * * * * ¡Þ¢ç¢Ì´¸³å²û²±±²²ê·»»ê¾¼Â¡·ß¶þ¶ºµÍ´÷Å¨ÇÙÊ³ÍÂÎõ»ÝºØ¹ø¹Â¸Û* ¡¾* * ¢©"
"* ¨±¨¦* * * * * * * ¾ê¾²½Ú½¥¼ÐÅÛÆ­Ç¥ÇåÈÁÁÞÁ­ÀÆ¿ì¿ÂÉ±ÉêÊÉË¦ËÅÄùÄ¿ÃâÃ¢ÂÅËõÌÕÍ«ÍçÎÑ"
"* * * * * * * * * * ¾í¾´½Û½­¼ÑÅÜÆ¶Ç¦ÇæÈÂÁåÁ²ÀÉ¿î¿ÅÉºÉëÊÊË§ËÍÄúÄÁÃäÃ¥ÂÆËúÌÖÍ±ÍëÎÒ"
"¨º¨µ¨ª¨¿* * * * * * ¾î¾¶½Ü½®¼×ÅàÆ¹Ç«ÇìÈÊÁçÁµÀË¿ï¿ÇÉÄÉíÊÐË«ËÏÄûÄÃÃêÃªÂÌÌ¡Ì×ÍµÍïÎÝ"
"* * * * * * * * * * ¾ô¾¸½Þ½±¼ØÅâÆ½Ç­ÇïÈÑÁñÁ¶ÀÍ¿ñ¿ÉÉÍÉîÊ×Ë°ËÐÄþÄÄÃïÃ²ÂÑÌ¥ÌÛÍ¶ÍôÎÞ"
"* ¨°¨¥* * * * * * * ¾ö¾½½á½·¼ÙÅãÆ¿Ç´ÇñÈÒÁòÁºÀÒ¿ò¿ÏÉÐÉõÊæË³ËÑÅ¡ÄÆÃòÃ¸ÂÕÌ¨ÌæÍÀÍùÎå"
])

(setq tcode-non-2-stroke-char-list
      (mapcar (function
	       (lambda (str)
		 (tcode-string-to-char str)))
	      '("*")))

(setq tcode-special-commands-alist
      '(
	((26 23) . tcode-bushu-begin-conversion) ; jf : Éô¼ó¹çÀ®ÊÑ´¹¤Î³«»Ï
	;; ¢¥[LL | LR | RL | RR] É½
	((0 0) . (lambda () (tcode-show-tables nil nil)))
	((0 9) . (lambda () (tcode-show-tables nil t)))
	((9 0) . (lambda () (tcode-show-tables t nil)))
	((9 9) . (lambda () (tcode-show-tables t t)))
	))

;;; ttc-rtbl.el ends here
