;;; ttc-ltbl.el --- TT-Code left table data

(setq tcode-tbl [
"* * * * §¿§ï* * * * * * * * * ÈßÉ²ÉòÊÚËÈ* * * * * ËøÌÒÍ¤ÍæÎÇ* * * * * Ï¤ÏËÙÇ* * "
"* * * * §À§ð* * * * * * * * * ÈÛÉ°ÉïÊÓË²* * * * * Ë÷ÌÎÌüÍäÎÆ* * * * * Ï¡ÏÊØÝ* * "
"* * * * §Á§ñ* * * * * * * * * ÈÙÉ¯ÉìÊÏË±* * * * * ËóÌÍÌúÍàÎÂ* * * * * ÎþÏÉØË* * "
"* * * * * * * * * * * * * * * ÈØÉ­ÉçÊÎË¯* * * * * ËòÌËÌùÍÝÎ¿* * * * * ÎüÏÆ×ü* * "
"* * * * * * * * * * * * * * * ÈÔÉ«ÉàÊÍËª* * * * * ËñÌÉÌ÷ÍÚÎ¼* * * * * ÎûÏÄ×óîþ* "
"* * * * * * * * * * ¹Ï¸è·þ·¶¶ë* * * * * ½¯¼¸»¸ºëº¯* * * * * Á»ÀÔ¿Û¾ç¾¥* * * * * "
"* * * * * * * * * * ¹Ð¸é¸§··¶í* * * * * ½²¼»»¹ºìº±* * * * * Á½ÀØ¿ß¾ñ¾¨* * * * * "
"* * * * * * * * * * ¹Ñ¸ê¸°·½¶ï* * * * * ½³¼½»¼ºíº³* * * * * Á¾ÀÙ¿à¾ó¾ª* * * * * "
"* * * * * * * * * * ¹Ü¸ï¸´·¾¶ð* * * * * ½¶¼Ã»¾ºðºµ* * * * * Á¿Àæ¿é¾÷¾«* * * * * "
"* * * * * * * * * * ¹Þ¸ñ¸¾·Å¶ô* * * * * ½º¼Ä»Áºóº·* * * * * ÁÀÀí¿í¾ý¾±* * * * * "
"* * ¦¡£Á§¡§Ñ£á¦Á* * ±Ã±®°ê°¾°ªÈöÉÀÊ¥ÊåËÕ³ï³Á²ú²Å±ðÌªÌßÍ°ÍöÎÖ¶ÏµúµÃ´á´¡Ï®ÏÐàú* * "
"* * ¦¢£Â§¢§Ò£â¦Â* * ±Â±­°ç°½°¨ÈõÉ¿ÉùÊãËÔ³ë³¿²ö²À±íÌ§ÌÞÍ¯ÍõÎÕ¶ÎµøµÂ´à³þÏ¬ÏÏÝµ* * "
"* * ¦££Ã§£§Ó£ã¦Ã* * ±Á±¬°â°¼°§ÈðÉ»ÉøÊàËÓ³æ³¾²ï²¶±ëÌ¢ÌÝÍ®ÍòÎÔ¶ÍµôµÀ´Ü³ýÏ¨ÏÎÜ´* * "
"* * ¦¤£Ä§¤§Ô£ä¦Ä* * ±¾±ª°à°»°£ÈìÉ·ÉöÊßËË³â³½²ë²´±æËûÌÙÍ¬ÍìÎË¶Æµèµ¸´Ú³üÏ¦ÏÍÛ£* * "
"* * ¦¥£Å§¥§Õ£å¦Å* * ±½±¨°Ú°º°¢ÈåÉµÉóÊÜËÊ³á³¼²é²³±åËùÌØÍ¨ÍéÎÊ¶Âµäµµ´Ò³ûÏ¥ÏÌÙõ* * "
"* * ¦¦£Æ§¦§Ö£æ¦Æ* * ¹ã¸ó¸¿·Ë¶÷ÁóÂÒÂýÃ¾Ãü½¿¼Å»Âºôº»ÄÐÄòÅ»ÅäÆ¾ÁÁÀñ¿ð¿¡¾³ÆÛÆòÇ¹ÇèÈ¦"
"* * ¦§£Ç§§§×£ç¦Ç* * ¹å¸ö¸Á·Í¶úÁùÂ×ÂþÃ¿Ãý½È¼Æ»Æºõº¼ÄÑÄôÅ¼ÅåÆÂÁÉÀó¿ó¿¤¾¹ÆÜÆöÇ¿ÇéÈ§"
"* * ¦¨£È§¨§Ø£è¦È* * ¹è¸û¸Ã·Î¶ûÂªÂÜÃ¡ÃÁÃþ½Ô¼È»ÓºúºÀÄÓÄõÅ½ÅæÆÅÁÌÀù¿÷¿ª¾»ÆÝÆ÷ÇÁÇêÈ«"
"* * ¦©£É§©§Ù£é¦É* * ¹ê¹¢¸È·Ò¶üÂµÂÝÃ¤ÃÉÄ¡½×¼É»ÚºûºÁÄÔÄöÅ¿ÅèÆÊÁÑÀú¿ú¿¬¾¿ÆáÆøÇÂÇëÈ®"
"* * ¦ª£Ê§ª§Ú£ê¦Ê* * ¹ì¹¤¸Ñ·Ó¶ýÂ¶ÂãÃ§ÃÐÄª½Ø¼Ê»ÛºüºÃÄÕÄ÷ÅÃÅîÆËÁÖÀü¿û¿¸¾ÀÆãÆúÇÅÇíÈ°"
"* * ¦«£Ë§«§Û£ë¦Ë* * ±Ï±¶°ô°Ç°±É¢ÉÉÊ²ÊùËé³õ³É³®²Ü²¢Ì¶ÌåÍÃÎªÎæ¶Ù¶©µÌ´ì´¼Ï¸Ó®æ·* * "
"* * ¦¬£Ì§¬§Ü£ì¦Ì* * ±Î±µ°ó°Ä°°ÈýÉÈÊ±Ê÷Ëæ³ó³Ç³ª²Ø±ùÌ°ÌãÍÁÎ£Îâ¶Ö¶¤µË´ç´»Ï¶ÑëåÌ* * "
"* * ¦­£Í§­§Ý£í¦Í* * ±Í±´°ñ°Á°¯ÈüÉÇÊ­ÊòËÚ³ò³Ä³©²×±õÌ­ÌâÍ¸ÍþÎÜ¶Õ¶£µÉ´æ´¯ÏµÐþäÆ* * "
"* * ¦®£Î§®§Þ£î¦Î* * ±Ì±³°î°À°¬ÈûÉÆÊ«ÊîËØ³ñ³Ã³¢²Ó±òÌ¬* Í´ÍüÎÛ¶Ó¶¢µÇ´å´¦Ï´Ð§äµ* * "
"* * ¦¯£Ï§¯§ß£ï¦Ï* * ±Å±°°ë°¿°«ÈúÉÅÊ¦ÊêËÖ³ð³Â³¡²Ñ±ñÌ«ÌàÍ²ÍûÎÚ¶ÒµüµÅ´â´£Ï±ÏÒáç* * "
"* * ¦°£Ð§°§à£ð¦Ð* * ¹í¹¨¸Ò·Õ·¢Â·ÂäÃ¨ÃÒÄ­½Ù¼Ó»â»¢ºÈÄÖÄüÅÆÅñÆÎÁ×Àý¿ü¿º¾ÁÆäÆûÇÇÇðÈµ"
"* * ¦±£Ñ§±§á£ñ¦Ñ* * ¹ô¹«¸Ó·Ø·£Â½ÂéÃ©ÃØÄ³½Ý¼Ý¼¤* ºÉÄ×ÄýÅÈÅóÆÐÁÙÁ¢¿ý¿¾¾ÅÆåÇ£ÇÊÇóÈ·"
"* * ¦²£Ò§²§â£ò¦Ò* * ¹÷¹®¸Ô·Û·¥ÂÁÂëÃ¬ÃÚÄµ½ß¼Þ¼¦»§ºÓÄØÅ¢ÅÊÅõÆÑÁÚÁ£¿þ¿Á¾ÔÆæÇ¨ÇÍÇôÈ¸"
"* * ¦³£Ó§³§ã£ó¦Ó* * ¹ù¹·¸Õ·á·¦ÂÃÂíÃ­ÃÞÄ¸½æ¼â¼©»©ºÔÄÙÅ£ÅËÅøÆÒÁßÁ¤À¢¿Ä¾ÕÆçÇ©ÇÎÇøÈ¹"
"* * ¦´£Ô§´§ä£ô¦Ô* * ¹ú¹¸¸Ö·ä·§ÂÈÂïÃ®ÃðÄ½½ì¼æ¼¬»ªºÖÄÛÅ¤ÅÎÆ¡ÆÓÁäÁ§À¨¿Ð¾ÖÆèÇªÇÖÇüÈº"
"* * ¦µ£Õ§µ§å£õ¦Õ* * ±â±¼±¥°Ø°¹ÉªÉÚÊËË©Ëð³ú³à³»²å²²ÌÆÌïÍÖÎ·Îú¶ê¶¾µâµ«´ÐÏÁ×Ãíå* * "
"* * ¦¶£Ö§¶§æ£ö¦Ö* * ±á±»°þ°Ô°¶É¨ÉÖÊÈË¨Ëï³ù³ß³¸²ä²®ÌÅÌíÍÔÎ°Îù¶é¶±µØµ©´ÍÏ¾ÔÌí©* * "
"* * ¦·£×§·§ç£÷¦×* * ±Þ±¹°ý°Ð°´É¦ÉÎÊÇË£Ëî³ø³Þ³·²â²ªÌ½ÌìÍÐÎ¯Îê¶æ¶°µÐµ¦´ÈÏ½ÓÞìÅ* * "
"* * ¦¸£Ø§¸§è£ø¦Ø* * ±Ý±¸°ü°É°³É¥ÉÌÊÃÊþËí³÷³Ü³³²à²©ÌºÌêÍÌÎ­Îè¶Þ¶¬µÏµ£´ÃÏ¼ÓÌëß* * "
"* * * £Ù§¹§é£ù* * * ±Ð±·°ö°È°²É£ÉËÊµÊûËê³ö³Ò³±²Þ²¨Ì¹ÌéÍÅÎ«Îç¶Ü¶ªµÎ´ò´ÂÏ¹ÓÈë¾* * "
"* * * £Ú§º§ê£ú* * * ¹û¹º¸×·å·¨ÂÉÂñÃ³ÃñÄÇ½í¼ð¼®»«ºãÄÜÅ§ÅÑÆ¢ÆÔÁæÁ¨À³¿Ñ¾ØÆéÇ¬Ç×ÇýÈ»"
"* * * * §»§ë* * * * ¹ý¹¼¸Ù·í·©ÂÊÂöÃ¶ÃôÄÈ½ò¼ö¼²»¬ºåÄÝÅ­ÅÒÆªÆÕÁéÁ®À´¿Õ¾ßÆêÇ±ÇàÈ¡ÈÀ"
"* * * * §¼§ì* * * * º¡¹À¸Ú·ñ·ªÂËÂøÃ·ÃõÄÊ½ó¼ú¼³»­ºæÄßÅ®ÅÕÆ´Æ×ÁìÁ·ÀÃ¿Ö¾àÆëÇ²ÇáÈ£ÈÃ"
"* * * * §½§í* * * * º¥¹Ç¸à·ö·­ÂÍÂûÃ¹ÃöÄÎ½ú½§¼µ»¯ºçÄæÅ²ÅÖÆµÆØÁîÁ¸ÀÈ¿Ù¾áÆíÇ¶ÇâÈ¤ÈÅ"
"* * * * §¾§î* * * * º­¹É¸ã·ý·µÂÏÂüÃ½Ã÷ÄÏ½û½«¼¶»µºèÄðÅ¶Å×ÆºÆÙÁïÁ¹ÀÌ¿Ú¾äÆïÇ¸ÇçÈ¥ÈÐ"
])

(setq tcode-non-2-stroke-char-list
      (mapcar (function
	       (lambda (str)
		 (tcode-string-to-char str)))
	      '("*")))

(setq tcode-special-commands-alist
      '(((23 26) . tcode-mazegaki-begin-conversion) ; fj: ¸ò¤¼½ñ¤­ÊÑ´¹
	;; ¢¦[LL | LR | RL | RR] É½
	((0 0) . (lambda () (tcode-show-tables nil nil)))
	((0 9) . (lambda () (tcode-show-tables nil t)))
	((9 0) . (lambda () (tcode-show-tables t nil)))
	((9 9) . (lambda () (tcode-show-tables t t)))
	))

;;; ttc-ltbl.el ends here.
