;;; ttc-ltbl.el --- TT-Code Left table data

(setq tcode-tbl [
"* * * * * * * * * * * * * * * ÈßÉ²ÉòÊÚËÈ* * * * * ËøÌÒÍ¤ÍæÎÇ* * * * * Ï¤ÏË* * * "
"* * * * * * * * * * * * * * * ÈÛÉ°ÉïÊÓË²* * * * * Ë÷ÌÎÌüÍäÎÆ* * * * * Ï¡ÏÊ* * * "
"* * * * * * * * * * * * * * * ÈÙÉ¯ÉìÊÏË±* * * * * ËóÌÍÌúÍàÎÂ* * * * * ÎþÏÉ* * * "
"* * * * * * * * * * * * * * * ÈØÉ­ÉçÊÎË¯* * * * * ËòÌËÌùÍÝÎ¿* * * * * ÎüÏÆ* * * "
"* * * * * * * * * * * * * * * ÈÔÉ«ÉàÊÍËª* * * * * ËñÌÉÌ÷ÍÚÎ¼* * * * * ÎûÏÄ* * * "
"* * * * * * * * * * ¹Ï¸è·þ·¶¶ë* * * * * ½¯¼¸»¸ºëº¯* * * * * Á»ÀÔ¿Û¾ç¾¥* * * * * "
"* * * * * * * * * * ¹Ð¸é¸§··¶í* * * * * ½²¼»»¹ºìº±* * * * * Á½ÀØ¿ß¾ñ¾¨* * * * * "
"* * * * * * * * * * ¹Ñ¸ê¸°·½¶ï* * * * * ½³¼½»¼ºíº³* * * * * Á¾ÀÙ¿à¾ó¾ª* * * * * "
"* * * * * * * * * * ¹Ü¸ï¸´·¾¶ð* * * * * ½¶¼Ã»¾ºðºµ* * * * * Á¿Àæ¿é¾÷¾«* * * * * "
"* * * * * * * * * * ¹Þ¸ñ¸¾·Å¶ô* * * * * ½º¼Ä»Áºóº·* * * * * ÁÀÀí¿í¾ý¾±* * * * * "
"* * £á£Á* * ¦¡¦Á§¡§Ñ±Ã±®°ê°¾°ªÈöÉÀÊ¥ÊåËÕ³ï³Á²ú²Å±ðÌªÌßÍ°ÍöÎÖ¶ÏµúµÃ´á´¡Ï®ÏÐ* * * "
"* * £â£Â* * ¦¢¦Â§¢§Ò±Â±­°ç°½°¨ÈõÉ¿ÉùÊãËÔ³ë³¿²ö²À±íÌ§ÌÞÍ¯ÍõÎÕ¶ÎµøµÂ´à³þÏ¬ÏÏ* * * "
"* * £ã£Ã* * ¦£¦Ã§£§Ó±Á±¬°â°¼°§ÈðÉ»ÉøÊàËÓ³æ³¾²ï²¶±ëÌ¢ÌÝÍ®ÍòÎÔ¶ÍµôµÀ´Ü³ýÏ¨ÏÎ* * * "
"* * £ä£Ä* * ¦¤¦Ä§¤§Ô±¾±ª°à°»°£ÈìÉ·ÉöÊßËË³â³½²ë²´±æËûÌÙÍ¬ÍìÎË¶Æµèµ¸´Ú³üÏ¦ÏÍ* * * "
"* * £å£Å* * ¦¥¦Å§¥§Õ±½±¨°Ú°º°¢ÈåÉµÉóÊÜËÊ³á³¼²é²³±åËùÌØÍ¨ÍéÎÊ¶Âµäµµ´Ò³ûÏ¥ÏÌ* * * "
"* * £æ£Æ* * ¦¦¦Æ§¦§Ö¹ã¸ó¸¿·Ë¶÷ÁóÂÒÂýÃ¾Ãü½¿¼Å»Âºôº»ÄÐÄòÅ»ÅäÆ¾ÁÁÀñ¿ð¿¡¾³ÆÛÆòÇ¹ÇèÈ¦"
"* * £ç£Ç* * ¦§¦Ç§§§×¹å¸ö¸Á·Í¶úÁùÂ×ÂþÃ¿Ãý½È¼Æ»Æºõº¼ÄÑÄôÅ¼ÅåÆÂÁÉÀó¿ó¿¤¾¹ÆÜÆöÇ¿ÇéÈ§"
"* * £è£È* * ¦¨¦È§¨§Ø¹è¸û¸Ã·Î¶ûÂªÂÜÃ¡ÃÁÃþ½Ô¼È»ÓºúºÀÄÓÄõÅ½ÅæÆÅÁÌÀù¿÷¿ª¾»ÆÝÆ÷ÇÁÇêÈ«"
"* * £é£É* * ¦©¦É§©§Ù¹ê¹¢¸È·Ò¶üÂµÂÝÃ¤ÃÉÄ¡½×¼É»ÚºûºÁÄÔÄöÅ¿ÅèÆÊÁÑÀú¿ú¿¬¾¿ÆáÆøÇÂÇëÈ®"
"* * £ê£Ê* * ¦ª¦Ê§ª§Ú¹ì¹¤¸Ñ·Ó¶ýÂ¶ÂãÃ§ÃÐÄª½Ø¼Ê»ÛºüºÃÄÕÄ÷ÅÃÅîÆËÁÖÀü¿û¿¸¾ÀÆãÆúÇÅÇíÈ°"
"* * £ë£Ë* * ¦«¦Ë§«§Û±Ï±¶°ô°Ç°±É¢ÉÉÊ²ÊùËé³õ³É³®²Ü²¢Ì¶ÌåÍÃÎªÎæ¶Ù¶©µÌ´ì´¼Ï¸* * * * "
"* * £ì£Ì* * ¦¬¦Ì§¬§Ü±Î±µ°ó°Ä°°ÈýÉÈÊ±Ê÷Ëæ³ó³Ç³ª²Ø±ùÌ°ÌãÍÁÎ£Îâ¶Ö¶¤µË´ç´»Ï¶* * * * "
"* * £í£Í* * ¦­¦Í§­§Ý±Í±´°ñ°Á°¯ÈüÉÇÊ­ÊòËÚ³ò³Ä³©²×±õÌ­ÌâÍ¸ÍþÎÜ¶Õ¶£µÉ´æ´¯Ïµ* * * * "
"* * £î£Î* * ¦®¦Î§®§Þ±Ì±³°î°À°¬ÈûÉÆÊ«ÊîËØ³ñ³Ã³¢²Ó±òÌ¬* Í´ÍüÎÛ¶Ó¶¢µÇ´å´¦Ï´* * * * "
"* * £ï£Ï* * ¦¯¦Ï§¯§ß±Å±°°ë°¿°«ÈúÉÅÊ¦ÊêËÖ³ð³Â³¡²Ñ±ñÌ«ÌàÍ²ÍûÎÚ¶ÒµüµÅ´â´£Ï±ÏÒ* * * "
"* * £ð£Ð* * ¦°¦Ð§°§à¹í¹¨¸Ò·Õ·¢Â·ÂäÃ¨ÃÒÄ­½Ù¼Ó»â»¢ºÈÄÖÄüÅÆÅñÆÎÁ×Àý¿ü¿º¾ÁÆäÆûÇÇÇðÈµ"
"* * £ñ£Ñ* * ¦±¦Ñ§±§á¹ô¹«¸Ó·Ø·£Â½ÂéÃ©ÃØÄ³½Ý¼Ý¼¤* ºÉÄ×ÄýÅÈÅóÆÐÁÙÁ¢¿ý¿¾¾ÅÆåÇ£ÇÊÇóÈ·"
"* * £ò£Ò* * ¦²¦Ò§²§â¹÷¹®¸Ô·Û·¥ÂÁÂëÃ¬ÃÚÄµ½ß¼Þ¼¦»§ºÓÄØÅ¢ÅÊÅõÆÑÁÚÁ£¿þ¿Á¾ÔÆæÇ¨ÇÍÇôÈ¸"
"* * £ó£Ó* * ¦³¦Ó§³§ã¹ù¹·¸Õ·á·¦ÂÃÂíÃ­ÃÞÄ¸½æ¼â¼©»©ºÔÄÙÅ£ÅËÅøÆÒÁßÁ¤À¢¿Ä¾ÕÆçÇ©ÇÎÇøÈ¹"
"* * £ô£Ô* * ¦´¦Ô§´§ä¹ú¹¸¸Ö·ä·§ÂÈÂïÃ®ÃðÄ½½ì¼æ¼¬»ªºÖÄÛÅ¤ÅÎÆ¡ÆÓÁäÁ§À¨¿Ð¾ÖÆèÇªÇÖÇüÈº"
"* * £õ£Õ* * ¦µ¦Õ§µ§å±â±¼±¥°Ø°¹ÉªÉÚÊËË©Ëð³ú³à³»²å²²ÌÆÌïÍÖÎ·Îú¶ê¶¾µâµ«´ÐÏÁ* * * * "
"* * £ö£Ö* * ¦¶¦Ö§¶§æ±á±»°þ°Ô°¶É¨ÉÖÊÈË¨Ëï³ù³ß³¸²ä²®ÌÅÌíÍÔÎ°Îù¶é¶±µØµ©´ÍÏ¾* * * * "
"* * £÷£×* * ¦·¦×§·§ç±Þ±¹°ý°Ð°´É¦ÉÎÊÇË£Ëî³ø³Þ³·²â²ªÌ½ÌìÍÐÎ¯Îê¶æ¶°µÐµ¦´ÈÏ½* * * * "
"* * £ø£Ø* * ¦¸¦Ø§¸§è±Ý±¸°ü°É°³É¥ÉÌÊÃÊþËí³÷³Ü³³²à²©ÌºÌêÍÌÎ­Îè¶Þ¶¬µÏµ£´ÃÏ¼* * * * "
"* * £ù£Ù* * * * §¹§é±Ð±·°ö°È°²É£ÉËÊµÊûËê³ö³Ò³±²Þ²¨Ì¹ÌéÍÅÎ«Îç¶Ü¶ªµÎ´ò´ÂÏ¹* * * * "
"* * £ú£Ú* * * * §º§ê¹û¹º¸×·å·¨ÂÉÂñÃ³ÃñÄÇ½í¼ð¼®»«ºãÄÜÅ§ÅÑÆ¢ÆÔÁæÁ¨À³¿Ñ¾ØÆéÇ¬Ç×ÇýÈ»"
"* * * * * * * * §»§ë¹ý¹¼¸Ù·í·©ÂÊÂöÃ¶ÃôÄÈ½ò¼ö¼²»¬ºåÄÝÅ­ÅÒÆªÆÕÁéÁ®À´¿Õ¾ßÆêÇ±ÇàÈ¡ÈÀ"
"* * * * * * §¿§ï§¼§ìº¡¹À¸Ú·ñ·ªÂËÂøÃ·ÃõÄÊ½ó¼ú¼³»­ºæÄßÅ®ÅÕÆ´Æ×ÁìÁ·ÀÃ¿Ö¾àÆëÇ²ÇáÈ£ÈÃ"
"* * * * * * §À§ð§½§íº¥¹Ç¸à·ö·­ÂÍÂûÃ¹ÃöÄÎ½ú½§¼µ»¯ºçÄæÅ²ÅÖÆµÆØÁîÁ¸ÀÈ¿Ù¾áÆíÇ¶ÇâÈ¤ÈÅ"
"* * * * * * §Á§ñ§¾§îº­¹É¸ã·ý·µÂÏÂüÃ½Ã÷ÄÏ½û½«¼¶»µºèÄðÅ¶Å×ÆºÆÙÁïÁ¹ÀÌ¿Ú¾äÆïÇ¸ÇçÈ¥ÈÐ"
])

(setq tcode-non-2-stroke-char-list
      (mapcar (function
	       (lambda (str)
		 (tcode-string-to-char str)))
	      '("*")))

(setq tcode-special-commands-alist
      '(((23 26) . tcode-mazegaki-begin-conversion) ; fj: ¸ò¤¼½ñ¤­ÊÑ´¹
	;; ¢£[LL | LR | RL | RR] É½
	((0 0) . (lambda () (tcode-show-tables nil nil)))
	((0 9) . (lambda () (tcode-show-tables nil t)))
	((9 0) . (lambda () (tcode-show-tables t nil)))
	((9 9) . (lambda () (tcode-show-tables t t)))
	))

;;; ttc-ltbl.el ends here.
